有人说我们的前端圈很浮躁，新人功底差，没有老一辈程序员的精神……就个人而言，我承认我确实做不了20个引体向上，但一些事情是有原因的。

我接触前端差不多2年，看书、问前辈要修炼方法、积累、挖掘某些点……现在马上要出厂了（毕业论文就放在桌上，时间真巧），仔细一想却很心虚：

-  box model

-  line box

-  layout(position, overflow)

-  flow(in-flow/out of flow)

-  containing block

-  bfc/vfc

-  margin collapse

-  base line

-  writing mode

-  bidi

-  aural style sheet

-  ...<http://www.cnblogs.com/winter-cn/archive/2013/05/11/3072926.html>

这些东西有用吗？没有用吗？但作为前端，这绝对是基本功，基础中的基础。

最初我也觉得“虚的”没用，知道bfc的人就比我强么？不知道这些就搞不定页面布局吗？

慢慢发现功力深厚的前辈“总拿规范说事”（当然，只是玩笑话），并不是说不懂bfc就会被鄙视，但想走得更远的话，那些欠下的东西早晚要还，可况作为前端，连课本都没读过，怎么说得过去？

到我想看课本的时候（也就是[翻译CSS3 Selector](http://www.ayqy.net/blog/css%E9%80%89%E6%8B%A9%E5%99%A8%E5%88%86%E7%B1%BB%E6%80%BB%E7%BB%93/)的时候，2015.3），发现_没有中文版_可以看……当然，在我之前肯定也有很多人发现了这个问题，前辈们研读了spec，理解得比我深得多，但他们现在很忙。嗯，就是那个死结——技术好的不写书，而写书的技术不那么顶尖。

好在很多前辈都很亲切，你愿意问，他就愿意告诉你。而这样的环境，对于入行的新人来说，不是十分_友好_。

对比[W3C日文文档](https://www.w3.org/2005/11/Translations/Lists/ListLang-ja.html)的完成度，真是惊呆了。

这些话本不应该由稚嫩的前端新人来说，但事实就是这样。